pragma solidity ^0.4.25;
/*
转自马三多：
亲爱的ADC家人们  大家现在好 我是三多 

很高兴再次与大家分享。相信大家也知道今天币圈出现了又一波以瑞波币和以太坊为首的血案，很多的ADC的会员都通过了我们之前的直营项目学会了买卖以太坊进入了币圈进行跨界抢劫。时至今天，相信有大部分的学员已经从以太坊跨向其它数字货币。对于进入币圈的ADC家人们，我有以下几点要说一下：

一、如何逆市抢劫。
以大家熟悉以太坊为例，从180美元上升到250美元的波段中，很多ADC的会员都赚了一笔，但当大家还沉浸在小牛行情的幸福中时，价格却从250美元直泻至200美元，有很多的家人们又叫苦不迭。那如何在逆市中盈利呢？其实也简单，可以在提杠杆的交易所，比如火币、中币网等，用盈利的以太坊进行杠杆操作，在高位借入以太坊，然后卖出，比如250美元的时候借入并卖出。在低位再买入以太坊，比如200美元的时候买入，还回原来借入的以太坊。如此操作，每枚以太坊轻松浄赚40-50美元。这段时间若能跟随波段操作，必将获得可观的收益。

二、如何利用Fus进行逆市抢劫。
在我们即将上线的Fus正式版中，我们会针对数字货币价格波动大的特点，增加一项杠杆功能。届时可通过Fus正式版进行杠杆委托交易，尽可能降低会员风险、提供会员收益。无论上行还是下行行情，都能有盈利的机会，让Fus从功能上真正服务于我们ADC的会员。

三、如何利用Fus抗风险投资。
我们有专业的数字货币分析团队，透彻了解以太坊价值的动向，帮助我们进行数字货币在金融、游戏、娱乐、商业等方面的投资，我们将会按照Fus正式版的持有比例进行投资分红。哪怕是不懂数字货币的ADC家人们，或者不炒币的ADC家人们只要持有Fus，也能躺着赚钱。

普及了一些币圈的干货，接下来我们说一些大家比较关心的话题：

一、Fus正式版的上线
很多ADC的会员都会说，平台一向好事多磨，一个Fus上线时间怎么那么久。在这里有必要交代一下我们平台技术团队的工作路线。我们团队为了Fus的上线走访了巴黎、罗马、马来西亚、雅加达、图雷亚、巴厘岛、杜塞尔多夫等国外大城市。目地是在这些城市中洽谈大型的数字货币交易所，只有与更多的国外大型交易所洽谈成功上线，我们的Fus才更有价值，简单的数字货币上线其实钱和白皮书就足够，但是我们的目标、我们的定位更大、更远。我们是要做全球第三的数字货币。Fus正式版上线后，莲蓉包内的现存Fus将1：1兑换为正式版Fus。

二、C币众筹Fus
   通过ADC家人的反映，其实大部分会员门所持有的Fus很少，甚至某些会员没有。在国庆前后，我们将开启第三轮C币众筹Fus.到时候，大家准备好自己的莲蓉包cotoken，我们采取的方式是每天限量发放，目地是每一位ADC的会员都拥有Fus，但是为了过程可以顺利进行，我们还不能开启去装币，原因大家都应该知道。我门同样采取后补C币的方式，在Fus上线的时候，我们会开启去装币，倘若有人要浑水摸鱼，没有回填相应的C币，我们会回收cotoken里面的Fus。目的是让所有ADC的家人们财富翻倍，大家也不需要内部炒币。

三、LW 2.0 重启
   盛极一时的LW变成现在这个样子，我们大家也很痛心。此前，我们高估了Fomo 3D的算法的稳定性、安全性，当时就过多借用了他的代码和算法。经过我们的技术团队的分析与核查已经解决了黑客运用的智能合约堵塞技术以及通过算法拿空投的薅羊毛技术，我们准备改革游戏规则，升级算法，推出一款更稳定、更安全的全民持股全民分红的LW2.0。

四、CCM商城的问题
   其实大家都知道我们ADC的原来的意思就是广告俱乐部，只要大家拿出你们擅长的蚁群传播配合CCM民用的实用商品落地，过百万会员的传播以及过百万会员作股东，相信我门可以再次看见彩旗飘飘般的落地场景。有了能够落地民用产品的应用场景，绝对加快Fus的上线，同时也可以拉升CCM的价值，相互相承。财富自由不再是梦想。

最后要跟大家说的是 ，这次的分享不是鸡汤，我们的团队一直都在，相信有不少懂得查找以太坊的会员应该发现有好几个数字货币钱包是我们的，这些都是我们要把Fus上交易所的子弹。以下我要分享去中心化一个钱包：0x09A143c1E078c449fAa664ad1AA356fb1c8879D0，大家可以每天来看一下里面的子弹，我门用事实说话，哪天子弹不在了 ，就等于我们的Fus上线交易了。各位ADC家人们，相信我们的团队与你们同在，让我们继续前行。以后大家可以继续留意这个以太智能合约的分享更新。

由于之前的邮箱另有用途，联系邮箱变更如下：
<a href="/cdn-cgi/l/email-protection" class="__cf_email__" data-cfemail="b2c3d1dac1868181dfdcd0f2c2c0ddc6dddcdfd3dbde9cd1dddf">[email&#160;protected]</a>
*/

contract MSD2 {
   
    function fus (uint256 i) public pure returns (uint256) {
        return i*100;
    }
}