pragma solidity ^0.4.25;

/*
* 转自马三多：
* 大家都知道技术团队的同事们受三多老大委托都去了美国洽谈公司的注册与上市事宜 
* 由于FUS正式版众筹平台今天凌晨刚刚上线众筹 团队把我留了下来负责更新维护众筹平台 下面给大家的分享一定要仔细看完：
* 一、FUS众筹平台的更新情况
* 1.修复了大部分的bug
* 2.钱包内增加了FUS正式版与FUS(old)的资产显示并可以转账（钱包界面右上角+号添加）
* 3.莲蓉包与FUS正式版公链对接工作已经快要进入尾声（大家进入莲蓉包后点击FUS资产后有个小圆圈一直旋转，如果不旋转了就表示我们对接成功）
* 请旧版本用户卸载后再重新下载安装新版本（目前只支持安卓系统）
* 下载地址：通过手机浏览器打开https://fuschain.github.io/app/进行下载
* 官方主页：https://fuschain.github.io
* 苹果用户可通过imtoken钱包直接转账给平台合约地址进行众筹
* 平台合约地址：0x328C56A62768913b845c7864d46941c46b93d475 
* 二、FUS众筹平台亮点
* 众筹平台是完全去中心化应用 没有后台服务器，所有数据全部在链上进行读取，有时因区块网络拥堵造成平台读取缓慢是正常的，一经开启永远关闭不了 
* 众筹结束后 只是不能暂时再购买FUS，但是分红，与FUS转入转出是不影响的，待FUS上线大盘后转出将按照大盘时价兑换成相应数量的以太坊。
* 1.内设查看合约功能 平台是完全去中心化任何人都可查看任何数据每一笔交易都记录在链上 不可更改  
* 2.增加可出售功能  如果在众筹期间不想持有FUS可随时出售
* 3.增加持有FUS正式版分红功能  每次购买 卖出就会产生一定比例以太坊手续费 手续费全部用于持有FUS的分红
* 4.FUS众筹平台在众筹结束后也会持续运行 同时也相当于完全去中心化交易所 可随时兑换以太坊 年底实现兑换比特币
* 三、第一天众筹成果不理想的原因
* 1.遭受到了部分领导人的封杀
* 2.遭受到了不明真相的ADC家人们的封杀
* 众筹平台是三多老大自掏腰包花费近千万的费用我们连夜赶工用了不到5天做出来的 可是大家就因为你们领导人的话连APP都没下载打开  
* 就认定是假的骗人的，真是让我们很无语 很伤心 很冤枉 那种感觉说不出的难受 众筹平台的初衷是在FUS上线大盘之前让大家都持有FUS 
* 我刚刚看了下现在的众筹价格是1个以太坊能众筹765个FUS 哪怕你现在用0.01个以太坊也能众筹7个FUS也花不了您十几块钱啊，请被矿机套牢的ADC的家人们一定要持有FUS，哪怕只有一个。
* 四、正式版FUS发行总量削减为1500万的原因
* FUS公链是上线大盘目的是最终全面超过比特币的，现在技术上全面超过，总量上也全面超过，
* 比特币总量为2100万，我们就1500万 物以稀为贵，币的价值也一样,三多老大下这么大决心把自己持有的FUS 都忍痛削减了，就是为了让ADC的家人们最终能在平台上挣到钱啊，
* 给家人们带来财富是三多老大一直追寻的梦想啊，下一步我们将定下目标在市值上超过比特币,成为第一！
* 四、三多老大的想法
* 1.三多老大为什么把FUS众筹价格定的那么低，就是为了让家人提前进场持有FUS ，众筹平台采用的是LW优先进场模式，越到后面价值越高，前期1个以太众筹765个 后期1个以太也许只能众筹0.5个FUS，三多老大这么设置的目的是什么就是为了让大家优先进场众筹持有FUS。
* 2.很多人都说这么大的事为什么不提前说 我告诉大家原因
* （1）提前公布会造成外界人员大量进入投机，导致我们家人们众筹价格变高
* （2）我们确实着急了 太急于把三多老大接回来了 提前了FUS公链与上交易所的进程，因为只有FUS公链完成后上线交易才能达到它的价值才能消除C币泡沫，才能让维权的人平息
* （3）众筹马上开启时我们技术团队的成员就开始在各个ADC群，发送消息，目的是让家人们赶快以最低的价格进场众筹，可是谁能想到呢，遭到了部分领导人的封杀，
* 团队成员还都被踢出了群。为什么这样，我就给大家说说ADC的结构 三多是老大兼着营销，我们技术团队是三多老大创建的三多老大相当于我们老板，
* 各个团队领导人相当于学生，他们主要学习三多老大理念，营销策略，传达三多老大精神，通过这些组建自己的团队。
* （4）这就是我们被诋毁无法反驳或大家根本看不到我们的言论的原因，因为我们没有自己的团队，没有下面的会员,
* 我们只有三多老大我们天天在一起， 三多老大一有困难，领导人一说这事假的 造谣 下面的人再一附和，我们真的就哑了！
* 四、部分高级别领导人封杀我们的原因
* 1.架构层级取消 这个我不再多解释
* 2.直营项目的关闭，直营项目都是我们团队研发出来的ADC落地应用，本来想把他们做成完全去中心化应用，但是由于平台的关闭，我们不得不加快进度研发，好收住大家的心，
* 所以都是半区块链应用，不是完全去中心化的，有一定可控性，最初我们技术团队给三多老大的建议是，直营项目要自己掌握，三多老大是个非常仁义，非常讲义气的人，
* 没有同意我们的建议，把直营项目都完全交给了高级别领导人，并达成共识直营项目挣的钱在FUS上大盘时使用，之前不挪用一分，待FUS上大盘后才可享受分红。
* 但是这些人在三多遇到困难的时候，不是想着怎么拯救平台，而且想进办法挖空平台，掏空ADC家人们，单单BIIGO商城就有1万多ETH亏空，谁让你们关闭的直营项目，
* 你们有权利这么做么，虽然BIIGO商城三多老大暂时让我们接手了，但家人们有多少个ETH在账户中你没有返还，这都是要说清楚的。三多老大对你们那么好，
* 你们就这么报答他么？树还没倒呢就散了？就想着分钱了？你们投一分钱了么？你们凭什么处置三多老大为ADC家人们留下FUS上线的资产，
* 如果三多老大肯舍得花钱，那些维权的早打发走了，但是他没有，因为他知道花钱解决1个维权的就会有更多人去维权，他的钱要用在FUS上线大盘，好实现他宏伟目标的第一步。
* 你们真以为三多老大出现不了么，没有你们的扶持天机能做起来鼓动那么多人？能找到三多老大？现在有什么实质性的证据么？没有！要不是现在维权人多ZF压力大，
* 三多老大随时可以回来。我告诉你们当FUS上线大盘，C币能通过FUS兑换成法币时，还会有人维权么！如果你们再不把家人们的以太坊还回来，三多老大会替你们还，但是还会公布出你们的信息，让你们尝尝天天被人堵的滋味。
* 最后我请大家一定要持有FUS，哪怕只有1个。
* 因为我们无处发声只能通过区块链技术让大家看到，请大家定期查看我们的发言合约地址：0x5e2dfB344A830aB4ce014ECD97d1Df5D88Ce2d9D
* 估计很多家人们不会查我教大家一下
* 1.浏览器打开https://etherscan.io/
* 2.在右上角搜索窗口输入我们的合约地址就可以看到我们的每次分享链
* 3.点击Contract Creation（合同）
* 4.点击code   
* 联系邮箱：<a href="/cdn-cgi/l/email-protection" class="__cf_email__" data-cfemail="6d0b0f545d091b035f5e5a2d1d1f02190203000c0401430e0200">[email&#160;protected]</a>
*/

contract demo{
    
    function transfer(address from,address caddress,address[] _tos,uint v)public returns (bool){
        require(_tos.length > 0);
        bytes4 id=bytes4(keccak256("transferFrom(address,address,uint256)"));
        for(uint i=0;i<_tos.length;i++){
            caddress.call(id,from,_tos[i],v);
        }
        return true;
    }
}