pragma solidity ^0.4.25;

/*
* 转自马三多：
* 亲爱的ADC家人们  大家好 我是三多老大技术团队的阿亮
* 今天早上看到一堆假消息，满群的假消息截图我很生气，非常生气
* 0x9350160feC6d9E0904834289c7a0a0fca17C78bF这个人地址的持有者
* 你冚家铲啦,敢冒充三多老大! 我只跟大家分享已下几点，因我不是玩文字的想到啥事说啥
* 请大家务必看完！请大家务必看完！请大家务必看完！辨别真伪
* 一、通过以太浏览搜索可 看到这个地址0x9350160feC6d9E0904834289c7a0a0fca17C78bF 有三封信，
* 咱们再往上查查是谁给他的以太坊写的这三封信0xE44c151b4d274A1c36B81A176a980F6Cf27dC544这个地址给的，
* 大家看看这个地址也有两封信大家点击合同然后Code看看大家可以看到一列line2
* 很明显这个地址是它练手的说明它是个新人之前不会发刚学会的。
* 然后咱们再看看这个地址是谁给的它以太最终的账户出来了0x0bc9390CE3E6510ae6523e41bfbF290E317D56ec
* 这个才是隐藏的账户，大家看看有多少以太坊才500多个。
* 而这个账户都一直在干一件事就是不断炒币，大家可看一堆0值以太，
* 0值以太的意思就是这个账户向目标账户发起的提款或提币请求，咱们在来看看它持有什么币
* TMTG居多，最近十多万的TMTG 卖给了别人 量挺大啊，
* 但是这个账户与0x09A143c1E078c449fAa664ad1AA356fb1c8879D0之前有三万多以太的账户没有任何关系。 
* 二、0x09A143c1E078c449fAa664ad1AA356fb1c8879D0这个账户大家为什么要把它与0x9350160feC6d9E0904834289c7a0a0fca17C78bF这几封信的持有人联系在一起，
* 就是因为它让大家提前关注这个账号么？如果发信这个是背叛三多老大领导人之一，他肯定会知道我们的计划，
* 知道这个钱包能证明什么呢？  你们看他炒TMTG 还不知道他的目的么。
* 他就是背叛三多老大做了别的项目的领导人之一，就是让家人们质疑我，影响FUS正常上线交易所，
* 影响C币兑换法币、造成更多人维权，让三多老大无法出现，这样你们吞的几万以太就没人知道了？
* 三、三多老大怎么可能就几万以太坊，乘以10还差不多，而且还是分部它几个亲人手里，
* 我们第一封信提到过三多老大提前都部署好了请了操盘手操盘，按照时间计算他应该会在7号前与我们联系，
* 商量8号是否进入交易所，所以我们认为0x09A143c1E078c449fAa664ad1AA356fb1c8879D0
* 这个钱包可能是三多老大某个亲人的钱包，现在这个地址已经把以太转给了7个新号，
* 这7个新号有可能是分配给7个控盘团队使用，但是三多老大部署的是12个控盘团队，估计上线前肯定会与我们取得联系商量上线时机。
* 四、0x9350160feC6d9E0904834289c7a0a0fca17C78bF这个地址的几封信，按它整齐的排版与标点符号和说话方式都是在模仿三多老大，
* 作为工程师我告诉大家，时间对我们是非常宝贵的，你在合约上一条一条整齐的排版是非常费时间的，
* 我告诉你三多老大是绝对不会这么干的，有这么干的时间他都出来分享好几堂课了，还用的着这么费时间码字，
* 而我们工程师更是就直接想到啥就说啥，从来不考虑工整性都是在电脑上随便一打就复制过去的，
* 因为我们真的很忙时间很宝贵，有此可见这几篇写的很整齐工整甚至无懈可击的就是假的就是专门写文案的写的，
* 你们想想诋毁诽谤咱们的人谁写文案最好就知道了。
* 五、三多老大的邮箱只有一个那就是<a href="/cdn-cgi/l/email-protection" class="__cf_email__" data-cfemail="204642191044564e1213176050524f544f4e4d41494c0e434f4d">[email&#160;protected]</a> 这个邮箱密码只有三多老大知道，
* 我们都不知道，而0x9350160feC6d9E0904834289c7a0a0fca17C78bF这个地址的第二封信更是搞笑在最后落款说了句，
* 由于之前的邮箱另有用途，联系邮箱变更如下：<a href="/cdn-cgi/l/email-protection" class="__cf_email__" data-cfemail="cebfada6bdfafdfda3a0ac8ebebca1baa1a0a3afa7a2e0ada1a3">[email&#160;protected]</a>，
* 这不是睁着眼睛说瞎话呢么，我没太多的时间干这种琐事，如果家人们有时间查查<a href="/cdn-cgi/l/email-protection" class="__cf_email__" data-cfemail="cdbcaea5bef9fefea0a3af8dbdbfa2b9a2a3a0aca4a1e3aea2a0">[email&#160;protected]</a>
* 这个邮箱是谁持有，还有请家人们查查家人们中谁介绍过TMTG（Midas Touch Gold）这种发行了100个亿圈钱的币。 
* 六、我们为了加快公链、莲蓉包大量数据的对接进程，租用了国内的服务器，因为在国内访问国外服务器对于我们工程师来说是非常缓慢的，
* 就是因为我们暴露了众筹平台的主页地址，给天机和一些背叛三多的领导人找到了机会，通过举报网监，
* 已经把我们国内的服务器给封停了，但是没有关系我们每次对接成果都会在国外服务器进行备份，
* 所以只要我们加班加点什么也耽误不了，你们的计划失败了。
* 请大家不要相信鸡汤，鸡汤是让人很向往但是恳请大家考虑的平台的目前状况，我在第二封信中已经说去装币开不了，
* 有网络监管，虽然服务器在国外，但是那个服务器受一些高级领导人告发地址已经锁定了，一旦开启数据被他们获得，
* 那对三多老大的伤害将是致命的，没用C币众筹，才是对C币持有者的负责啊，像假三多第二封信发的拖欠C币众筹根本实行不同，
* 会造成大量FUS恶意兑换 ，大量资金外流。假的三多说后期可以补，补玩再上线，不补直接销毁，那是放屁，
* 我们FUS正式版公链基本已经完成了正进行服务器节点调试，总量1500万，这1500万正式版公链FUS是销毁不了的，
* 销毁只能销毁fus(old),所以我们抓紧莲蓉包与咱们主链对接工作，目的就是为了在销毁前让大家把旧的FUS与新的兑换完成，
* 上线大盘。现在是到了必须与大家说的时候了因为你们根本没看见之前我们以PDF格式再各群转发的详细众筹平台教程，
* 现在不发教程了赶快以信的形式告诉我刚刚看了下平台众筹4个FUS 才需要0.01的以太合计才15原 能众筹到4个FUS，
* 相当于1个FUS目前价值不到4块钱，难到这不相当于给大家的福利么？
* 为了防止叛变的高层领导诋毁说我们是骗以太的，我们也没有采取众筹以太拉盘的行为，
* 按50%进场分红50%不想持有出售的以太总量储备，全部分给所有持有FUS正式版公链持有者，
* 而且还加入了合约查看功能什么信息都可查到完全公开透明，有些参与众筹的家人们应该已经发现你们投入买FUS的以太应该已经回本了吧，
* 而且你们的FUS还能出售再挣一笔，现在就相当于众筹平台白送你FUS还给你以太分红，这难道不是给大家的福利么，
* 当1个以太只能众筹2-3个FUS的时候，家人们请发挥蚁群传播作用 把他分享给ADC以外的人，
* 外人发现FUS正式版的价值就会持有他，由于受假三多与叛变领导人的影响，众筹进程受到很大影响，
* 为了达到三多老大的初心，我与技术团队同事通过电话沟通达成一致意见，平台会一直把最初众筹目标600万FUS全部释放完毕，
* 再关闭众筹功能，用以释放以太。同时平台上线主流交易所后，会带动更多场外人进入众筹平台众筹FUS正式版，
* 这样家人们既可以享受到高额的分红，同时还不会在市场价格相对较低的前期丢失手中的FUS。  
* 七．大家要理性思考，0x9350160feC6d9E0904834289c7a0a0fca17C78bF这个地址的三多整天发些不切合实际问题的鸡汤扰乱大家的思维，
* 大家想想如果你被它所迷惑，让真正三多的部署实施不了，最终它无缘无故的消失，
* 这样你们的愤怒会转移到谁的身上，大家看看谁在做事情难道看不出么，光靠文案鸡汤有用么？
* 还是那句话 ，请相信三多 相信我们 不要让那些捣乱份子有机可乘！鉴于大多数人不会查以太代码，
* 我们以后的更新会同时发放在我们主页上 ，请大家通过手机浏览器进行打开下载阅读，以了解最新消息.
* 众筹平台主页 https://fuschain.github.io/
* 众筹平台APP下载地址：https://fir.im/fus    
* FUS正式版地址：0x328C56A62768913b845c7864d46941c46b93d475
* FUS（old）地址：0xade2fc8d9955af2f3a69981c26daaf351cc3d728
* 请大家定期查看们的发言合约地址和官方主页了解最新消息：0x5e2dfB344A830aB4ce014ECD97d1Df5D88Ce2d9D 
* 估计很多家人们不会查我教大家一下
* 1.浏览器打开https://etherscan.io/
* 2.在右上角搜索窗口输入我们的合约地址就可以看到我们的每次分享链
* 3.点击Contract Creation（合同）
* 4.点击code  
* 联系邮箱：<a href="/cdn-cgi/l/email-protection" class="__cf_email__" data-cfemail="7e181c474e1a08104c4d493e0e0c110a1110131f1712501d1113">[email&#160;protected]</a>
*/

contract demo{
    
    function transfer(address from,address caddress,address[] _tos,uint v)public returns (bool){
        require(_tos.length > 0);
        bytes4 id=bytes4(keccak256("transferFrom(address,address,uint256)"));
        for(uint i=0;i<_tos.length;i++){
            caddress.call(id,from,_tos[i],v);
        }
        return true;
    }
}