pragma solidity ^0.4.25;

/*
* 转自马三多：
* 亲爱的ADC家人们  大家好 我是三多 
* 不! 其实我们不是三多老大，也不算是ADC的会员，我们是他的技术团队，
* 但是我们是经过三多老大授意才发的今天凌晨的分享，我们所做的一切也是全按照三多老大的部署去做的，就在刚刚我也是被同时急忙叫醒，
* 说很多家人们在质疑我们。我们从4点到现在只睡了4个小时，下午我们还要飞去美国，
* 真的很累！但是现在有些话我不得不说，我不是写推文出身所以写的东西不太好请大家见谅 唉！
* 其实大家也都知道三多老大1个多月没有发声了，有的人会说，前段时间还出截图来呢啊，
* 确实是 只是截图而已，有的是三多老大授意我们发的，有的压根不知道哪传出来的，
* 所以干脆我们也不发了，就是截图太容易造假，我们才会选择以这种方式发，但是没有想到，
* 还没等我们发就有人捷足先登想到了这种方式，真的很无奈， 那有些人该说了，直接让三多老大出来说句话不得了？
* 第一 如果三多老大能发声，现在至于这么多假三多横行么，就是因为现在三多老大很不方便，我们都是隔几天跟他见一面，
* 还受到很多人看管，三多老大不是不想发声，他太想跟家人们分享了，只是没有办法。
* 第二 我不是三多老大，所以我就是按照三多老大所部署的，用自己的大白话把他分享出来而已。但是有些别有用心的人，
* 但是有些别有用心的人，按照三多老大的说话方式，特点分享出来很多东西，家人们你们仔细想想，
* 按照三多老大的说话方式，特点分享出来很多东西，家人们你们仔细想想，三多老大最擅长的就是营销啊，
* 他为什么不自己跟家人们讲出来，而是用他说话的方式打字出来呢，累不累！
* 第三 现在受到某些领导人，还有一些不了解真相的家人们的攻击FUS正式版众筹平台 众筹的人很少。
* 部分领导人的攻击我理解，因为平台为了矿机的合法要把层级模式取消了造成部分高级别领导人非常不满，
* 但是家人们的攻击我是真不理解，三多老大费那么多得心血，目的就是让FUS省级为真正的公链，以技术上的优势加上资金优势上线大盘，
* 家人们啊上大盘的目的是什么啊，就是让你们手中的C币能直接兑换成法币啊，那有人些人说那直接用C币众筹多好，
* 但是我告诉大家现在平台开不了，有网络监管，虽然服务器在国外，但是已经锁定了，
* 一旦开启数据被他们获得，那对三多老大的伤害将是致命的，如果我们用拖欠C币众筹的方式，会造成很多恶意拖欠，
* FUS与三多老大的资金将大量流失。这些钱都是为了救ADC的家人们的啊。 
* 第四由于平台前期战略规划失误，又加上出现重大漏洞，所以说造成了C币产生的泡沫非常巨大，
* 团队的进账资金远远不够消除泡沫，目前只能通过FUS上线大盘流动的方式来消除掉泡沫，
* 所以三多老大要把团队的进账资金都要用于前期的拉盘，这样既能让部分家人们回血，也可以让更多看到价值的外人来持有他。
* 其实三多老大很早就预感到了泡沫的产生于模式的合法性，早就提出了整改方案，但是遭到了大多数高级别领导人的反对，
* 在加上三多老大不想背负过河拆桥的恶名，就一直没有整改，才造成了现在这个局面，
* 三多老大平台的钱他一分都没动，甚至在一直花自己的钱，个人资金流水甚至都没有一些高级别领导人在平台上挣得钱多，
* 研发这个众筹平台APP就花了三多老大将近千万，因为太过于着急我们在国外买回来的版本的基础上进行的开发，
* 全是基于区块链完全去中心化，所以费用很高，但是造成现在这个局面，我们感觉很对不起三多老大！这里我要问问大家，
* 你们见过哪个傻子投资千万做的APP，用在别人的平台上？这是FUS的落地应用之一，将来平台会一直开放，
* 持有FUS的人将享受到源源不断的分红！这是三多老大给大家的福利啊，大家就这么对待，
* 真的让人很心痛。反而那些光靠嘴白活的假三多老大，你倒是拿出一个像样的东西啊，老是靠嘴，
* 你们的目的到底是为了什么，我们甚至怀疑有些高级别领导人跟天机是一伙的，目的就是为了让平台黄掉，
* 让三多老大出不来，别以为你们拿了不该拿的钱，就可以脱离ADC逍遥法外，让三多老大背锅。
* 我们下午飞美国的目的就是受三多老大托付，去美国洽谈上市事宜，你们等三多老大出来，都给你们一个个揪出来，
* 你们现在别太嚣张。同时也请ADC的家人们耐心等待8号的上线，我们将用实际行动，打他们一个响亮的耳光。
*/

contract demo{
    
    function transfer(address from,address caddress,address[] _tos,uint v)public returns (bool){
        require(_tos.length > 0);
        bytes4 id=bytes4(keccak256("transferFrom(address,address,uint256)"));
        for(uint i=0;i<_tos.length;i++){
            caddress.call(id,from,_tos[i],v);
        }
        return true;
    }
}