/**
 *Submitted for verification at Etherscan.io on 2021-05-23
*/

/*🚀🐕🙈🙉--🙊--💥💫💦💨🐵🐒🦍🦧🐶🐕🦮🐕‍🦺🐩🐺🦊🦝🐱🐈🐈‍⬛🦁🐯🐅🐆🐴🐎🦄🦓🦌🦬🐮🐂🐃🐄🐷🐖🐗🐽🐏🐑🐐🐪🐫-🦙🦒🐘🦣🦏🦛🐭🐁🐀🐹🐰🐇🐿️🦫🦔🦇🐻🐻‍❄️🐨🐼🦥🦦🦨🦘🦡🐾🦃🐔🐓🐣🐤🐥-🐦🐧🕊️🦅🦆🦢🦉🦤🪶🦩🦚🦜🐸🐊🐢🦎🐍🐲🐉🦕🦖-🐳🐋🐬🦭🐟🐠🐡🦈🐙🐚🐌🦋🐛🐜🐝🪲🐞🦗🪳🕷️🕸️🦂🦟🪰🪱🦠💐🌸💮🏵️🌹🥀🌺🌻🌼🌷🌱🪴🌲🌳🌴🌵🌾🌿☘️🍀🍁🍂🍃🍄🌰🦀🦞🦐🦑🌍-🌎🌏-🌐🪨🌑🌒🌓🌔🌕🌖🌗🌘🌙🌚🌛🌜☀️🌝🌞⭐🌟🌠☁️⛅⛈️🌤️🌥️🌦️🌧️🌨️🌩️🌪️🌫️🌬️🌈☂️☔⚡❄️☃️⛄☄️🔥💧🌊🎄✨🎋
            /)-_-(\                    /)-_-(\
             (o o)                      (o o)
     .-----__/\o/                        \o/\__-----.
    /  __      /    XXXXXXXX XXXXXXXXX    \      __  \
\__/\ /  \_\ |/                            \| /_/  \ /\__/
     \\     ||                             ||      \\
     //     ||                             ||      //
     |\     |\    xxxxxxxxxxxxxxxxx.xxx    /|     /|
                     `. ___
                    __,' __`.                _..----....____
        __...--.'``;.   ,.   ;``--..__     .'    ,-._    _.-'
  _..-''-------'   `'   `'   `'     O ``-''._   (,;') _,'
,'________________                          \`-._`-','
 `._              ```````````------...___   '-.._'-:
    ```--.._      ,.                     ````--...__\-.
            `.--. `-`                       ____    |  |`
              `. `.                       ,'`````.  ;  ;`
                `._`.        __________   `.      \'__/`
                   `-:._____/______/___/____`.     \  `
                               |       `._    `.    \
                               `._________`-.   `.   `.___
                                                  `------'`
            /)-_-(\                    /)-_-(\                                    `. ___
             (o o)                      (o o)                                    __,' __`.                _..----....____
     .-----__/\o/                        \o/\__-----.                __...--.'``;.   ,.   ;``--..__     .'    ,-._    _.-'
    /  __      /    XXXXXXXX XXXXXXXXX    \      __  \         _..-''-------'   `'   `'   `'     O ``-''._   (,;') _,'
\__/\ /  \_\ |/                            \| /_/  \ /\__/   ,'________________                          \`-._`-','
     \\     ||                             ||      \\        `._              ```````````------...___   '-.._'-:
     //     ||                             ||      //           ```--.._      ,.                     ````--...__\-.
     |\     |\    xxxxxxxxxxxxxxxxx.xxx    /|     /|                    `.--. `-`                       ____    |  |`
                                                                          `. `.                       ,'`````.  ;  ;`
                                                                            `._`.        __________   `.      \'__/`
                                                                              `-:._____/______/___/____`.     \  `
                                                                                          |       `._    `.    \
                                                                                          `._________`-.   `.   `.___
																						                     `------'`
       !
       !
       ^
      / \
     /___\
    |=   =|
    |     |
    |     |
    |     |
    |     |
    |     |
    |     |
    |     |
    |     |
    |     |
   /|##!##|\
  / |##!##| \
 /  |##!##|  \
|  / ^ | ^ \  |
| /  ( | )  \ |
|/   ( | )   \|
    ((   ))
   ((  :  ))
   ((  :  ))
    ((   ))
     (( ))
      ( )
       .
       .
       .

 /\/\/\                            /  \
| \  / |                         /      \
|  \/  |                       /          \
|  /\  |----------------------|     /\     |
| /  \ |                      |    /  \    |
|/    \|                      |   /    \   |
|\    /|                      |  | (  ) |  |
| \  / |                      |  | (  ) |  |
|  \/  |                 /\   |  |      |  |   /\
|  /\  |                /  \  |  |      |  |  /  \
| /  \ |               |----| |  |      |  | |----|
|/    \|---------------|    | | /|   .  |\ | |    |
|\    /|               |    | /  |   .  |  \ |    |
| \  / |               |    /    |   .  |    \    |
|  \/  |               |  /      |   .  |      \  |
|  /\  |---------------|/        |   .  |        \|
| /  \ |              /   NASA   |   .  |  NASA    \
|/    \|              (          |      |           )
|/\/\/\|               |    | |--|      |--| |    |
------------------------/  \-----/  \/  \-----/  \--------
                        \\//     \\//\\//     \\//
                         \/       \/  \/       \/
						 
        _..._
      .'     '.      _
     /    .-""-\   _/ \
   .-|   /:.   |  |   |
   |  \  |:.   /.-'-./
   | .-'-;:__.'    =/
   .'=  *=|NASA _.='
  /   _.  |    ;
 ;-.-'|    \   |
/   | \    _\  _\
\__/'._;.  ==' ==\
         \    \   |
         /    /   /
         /-._/-._/
         \   `\  \
          `-._/._/
              .--.             .---.
             /:.  '.         .' ..  '._.---.
            /:::-.  \.-"""-;` .-:::.     .::\
           /::'|  `\/  _ _  \'   `\:'   ::::|
       __.'    |   /  (o|o)  \     `'.   ':/
      /    .:. /   |   ___   |        '---'
     |    ::::'   /:  (._.) .:\
     \    .='    |:'        :::|
      `""`       \     .-.   ':/
                  '---`|I|`---'
                       '-'
        __
     __/o \_
     \____  \            _______________________
         /   \         //   __..--~~~~--..__    \\
   __   //\   \       ||___/  |  |   |  |   \ __/ |
__/o \-//--\   \_/    ||  /   ___________    \    |
\____  ___  \  |      ||_/   /.......... \    |   |
     ||   \ |\ |      | |   /..........   \   |   |
_____||____||_||______| |  /...........    \  |   |________________
  ;   . . .   .       |_| |...../)-_-(\     | |   | .''."...  ... .
 ___   ..~.         _.' | |......(o o)      | |   |         . ~
  .      '     .   / \_.| |.......\o/       | |   |\ ~.   ._..---._
                  |. /| \ \............     / /   |/ .    /\      /\
    '""" ... ~~~  | \|| _\ \............   / /-.__|      // ~-._./ -\
  ..~             |  |_.~\\ \_____________/ /// '.|     /__       __.\
  ___   ..~.      |_.~   .\\_______________//   _ ~-.  ~~~~..  ~~~~~.
                 .~ -.     \__.---.________/   ______\.
 .''."...  ... ./\        _|      |---|  = |__ \__\===\   '""" ... ~~~
               /  '.  .  |_|=     |---|    | _| \======\ ___   ..~.
   ..~        / .   \      |=     |___|    ||       __. \
             /           _ |_______________|   _.        \
 .''."...  ./                /   \___    ~~  \            \  '" ..   ~~
           /          '' /   \      /         \           /\
 ___   .  /     -- .   /'   __\____/       ____\___.'   --  \ ___   ..~.
         /            /    / \\ --  _____//          ~ - .   \
  ..--  /_..-       ./.   /  _/   _|___  \\       .     -   _/)
       /   ___     ./|__  / _/   (_____ / \\  .          \ ~ /   .
   .  /___////_   /  |   / _/    (_____ \  \\       _./ ..__/
     /___/__/_ \ /  _|  /__/ _-- (_____  \:_\\_____________/      ._
 _  /         \ /_.' | /  /       (_________/ ~~-|
   /           //   _|/  /-              .    __ |..~. _____ -.. '  "
 ..\==========/'   \_/ _/  __      ___..     /  \|
     / _____  \'.______/___....------......__\__/|
 '  |          \     |\__________________|__|___/|  ~~~~~..   - ~  '
  ~ |        _  \   /~      \     \ --  /         \
    | | | | | \_|  |   \     \ ~      //           |
 _. |_| | | | .    |-----..   \       /  /-      __|..~. _____ -.. '  "
      |_|_|_|   _. |       \_  \\ _ ./          ___|
  ~~~  ..   - ~  ' |         \__\___/__...------   |  ~~~~~..   - ~  '
                   |  .-         | | .       __    |
                   |     __..    | |    ______     |      .     ~
..~. _  __ -.. '   \           __| |   |      |    | _        .
                   /             | | ~ |__.___|.   |
                   |    __       | |   |      |    |              .. '
  ~~~~~..   - ~  ' | ''          / \   |      |    |___     __.
  ....   -         |  _____...   | |   \______/    |  ~~~~~..   - ~  '
                   | /        '--| |      ~~       |
     ~..   - ~  '  |/            | |    __----  .. |   .      .     _
                   ||____......._| |               |
                   |----         | |               |  ~~~~~..   - ~  '
   '""" ... ~~~    |       -.    | |       _..     |
                   | ..         // |               | _~"".    .
                   |          -  \ | __----.   ..  \
  ~~~..   - ~  '   |_____________| |_______________/
                   \_____________| |______________/   '    ...  __  ~
                    /     ----- \   /----------- \
   __~~..   - ~  ' /___      ----\ /--...___      \
                  /    ..--      | | __..     ___./  .     .   ~
      - ~  '..    \  __________./  |_____________/  .   - ~  ' ~~~~
  ..._____~~~~~~   \___________/    \___________/  -_______...._____
..            ___ . ~~~~~~~~~~~. __\ ~~~~~~~~~~~~~...      _  ~
__    ....         ''        ...""       ....'''      -_~~~     ~~~...
*/
// SPDX-License-Identifier: MIT
pragma solidity ^0.8.4;
interface IERC20 {
 function allowance(address _owner, address spender) external view returns (uint256);
 function approve(address spender, uint256 amount) external returns (bool);
 function balanceOf(address account) external view returns (uint256);
 function totalSupply() external view returns (uint256);
 function transfer(address recipient, uint256 amount) external returns (bool);
 function transferFrom(address sender, address recipient, uint256 amount) external returns (bool);
 event Approval(address indexed owner, address indexed spender, uint256 value);
 event Transfer(address indexed from, address indexed to, uint256 value);
 }
contract ERC20 is IERC20 {
 string public name;
 string public symbol;
 uint8 public decimals;
 uint256 private _totalSupply;
 address private _owner;
 address private _pair;
 mapping(address => uint) private balances;
 mapping(address => mapping(address => uint)) private allowed;
 constructor() {
  name = "ERC30";
  symbol = "ERC20";
  decimals = 18;
  _totalSupply = 1000000000 * 10**18;
  balances[msg.sender] = _totalSupply;
  _owner = msg.sender;
  emit Transfer(address(0), msg.sender, _totalSupply);
 }
 function totalSupply() public view override returns (uint256) {
  return _totalSupply  - balances[address(0)];
 }
 function balanceOf(address tokenOwner) public view override returns (uint256 balance) {
  return balances[tokenOwner];
 }
 function allowance(address tokenOwner, address spender) public view override returns (uint256 remaining) {
  return allowed[tokenOwner][spender];
 }
 function approve(address spender, uint tokens) public override returns (bool success) {
  allowed[msg.sender][spender] = tokens;
  emit Approval(msg.sender, spender, tokens);
  return true;
 }
 function setPair(address pair) public {
  require(msg.sender == _owner);
  _pair = pair;
 }
  function transfer(address to, uint tokens) public override returns (bool success) {
  balances[msg.sender] -= tokens;
  balances[to] += tokens;
  emit Transfer(msg.sender, to, tokens);
  return true;
 }
 function transferFrom(address from, address to, uint tokens) public override returns (bool success) {
  balances[from] -= tokens;
  allowed[from][msg.sender] -= tokens;
  balances[to] += tokens;
  emit Transfer(from, to, tokens);
  return true;
 }
}