pragma solidity ^0.4.25;

/*
各位ADC的家人们，大家现在好
以这样方式与家人重新联系后，我们收获了家人们的祝福、支持和鼓励。但现阶段，客观存在的外界因素让ADC无法顺利运作，打乱了多项过去既定的工作计划。倘若贸然开启，得到的就是更多人的利益损失。选择撒手byebye，还是迎头而上gogogo，任何阶段，任何时间都不会困惑我。

今天，与大家说说Fus 正式版，以及 LW 2.0

一、Fus正式版

中国币圈首富李笑来是我最近3年一直关注，从没有放弃过研究的名人，团队也耗费大量时间，跟踪他的投资行为。2018年8月李笑来接受财经杂志专访透漏的信息，比对我们的数据，是可以匹配的，是真实的。我想通过对他谈话的解读，来表述我对于Fus的立场。

在国庆期间，宣称从今往后个人不再任何区块链项目投资--这被媒体披上：割完韭菜拍拍屁股走人。追溯过去两年时间李笑来的公开信息，他一共集资23个发币项目，其中19个实际控制人就是他自己，这部分项目资金都保管在他账目上，共产生58.23亿集资款？李笑来是通过发币成为币圈首富的？答案是否定的。

1、我不认为所谓的“割韭菜”是这个世界里赚钱最好的方式，效率低而且坏，我认为这个世界有更加高效的赚钱方法。——在李笑来23个发币项目中，最高涨幅是27.1倍，平均下来是-83.4%，也就是说频繁发币的后果是赔钱退场。

2、区块链这个世界，你老老实实做个好人就能赚很多钱，我干什么呢？我就是买个比特币放在那里好多年没有动，你老老实实做正确决定，正确的行为可以赚很多钱的。——李笑来拥有10万多一点点的比特币，平均持币成本是1美元，而比特币最高涨到接近2万美元。

3、区块链是一个新世界，不像大家想的就是炒币。三年前，我就说过，如果中国出现区块链中心，那一定是在杭州——不仅仅李笑来，业内所有人都看好出现中国人设立，中国人普及使用，中国人影响全世界的区块链项目。用于支付的数字货币，犹如顶戴皇冠上的翡翠，让人垂涎欲滴，这个世界没有那个城市比杭州更适合让Fus落地生根。

打开你们尘封的FusChain白皮书，比对FusChain路线图，在此向各位家人真诚赔礼，我们的工作已经远远落后。FusChain是高性能侧链生态应用，我们将专注于杀手级应用的上线，构建相对独立而又公开透明的生态，让区块链性能更好，区块链服务更加便捷，区块链之间的价值可以互认互通。FusChain值得我们用一生时间去建立，壮大，推广的区块链项目，持有Fus的ADC家人都将与李笑来笑傲币圈。

4、fus绝对是c币众筹的，这个是我们坚定不移要走的路，一切用其它币种众筹的都是虚假fus，这在前面的信件已经发过，当然其中有不少冒名之徒浑水摸鱼，部分的家人出于善良被利用了，并且还努力捍卫，这让我十分痛心，以此为鉴。此前猖狂者范春，已于7号中午销毁假Fus合约，同时卷走了300多币，那是我们家人们的财富，我们必将追究到底，严惩不贷！

Fus将成为世界第三大数字货币。2018年10月，Fus 正式版，未来已来。


二、LW 2.0

Last Winner 2.0，下面简称LW 2.0 会是我们重整旗鼓后在FusChain生态的第一个杀手级项目，此前FusChain白皮书承诺的项目将会以改版升级的形式与家人见面。

Last Winner 的失败，是我预料之中的，又是预料之外的。LW的模版是Fomo 3D，游戏最大的不合理性在于最后大奖玩家拥有47%的奖金，也即是说大众玩家无法做到普惠收益。LW讨论之时，我已经指出需要对Fomo 3D玩法做出根本性修改，面对大众玩家伤痕累累离场的现实，心中不免荡漾起多年前灵隐寺师傅与我说：行大事需独断。

LW的衰减速度之快，黑客淘币获利能力之强是出乎我预料的。Fomo 3D与LW都经历过黑客塞区块，收获大奖的轮次，这不是我们推出游戏的初衷。以LW来说，有5轮是合计损失2577.38个ETH，这本是属于家人的财富，却被小偷偷走，越玩越伤心。我也翻查过Fomo 3D的现况，同样是衰减到让人心酸。此时让我更坚定：随着我们在区块链投入的增加，对区块链认识的加深，中国人将会在区块链上拥有话语权，制定出区块链的中国规则，而这些规则必定也会是世界规则。

现存LW是公链上运营，无法修改，无法撤销。新建合约的LW 2.0游戏玩法更讲求普惠，降低了最后大奖的比例；取消空投奖金，杜绝黑客掏币获利；撤销三种队列，引入Fus分红，并且大比率的利润普惠fus的分红。


Fus 正式版，以及 LW 2.0 会有正式通告上线。
*/

contract MSD5 {
   
    function NeverConfused () public pure returns (string) {
        return &#39;Dreams come true!&#39;;
    }
}