pragma solidity ^0.4.25;
/*
* 转自马三多：
* 致ADC家人们的第七封信
* 亲爱的ADC家人们  大家好 我是三多老大技术团队的阿亮
* 我先分享下我们团队的进展 再分享下某位领导人恶心丑陋的一面
* 一、目前GO币主链也马上完成  BiiGO商城授三多老大的嘱托我们也接管过来了
* 预计10月10日 GO币主链做好后开通 但是有个事情我得说下 BiiGO商城亏空的1万左右以太
* 你们是不是得还回来呀 还让三多老大替你们还啊不合适吧！
* 按计划商城应在9月份开通合伙人申请 10月合伙人玩法就已经上线
* 但是你们私自关闭商城影响了整个的规划部署 是不是呀 奥丁、、、 等一些高级别领导人
* 做人留一线日后好相见 奥丁太没脸我就先提他不提别人 还有那1万多以太你们在钱包里持好了啊
* 别卖 卖到交易所你就会被我们找到 交易所我都熟调你个身份信息不成问题
* 我们不会像假三多第三封信说的那样拿家人们当枪使找我们 我们会亲自上门找你
* 听见了么别卖 还有其他直营项目里的以太也都留好了！
* 二、奥丁扑街啦你 中午发的信已经很给你面子了 你还没玩了  还JJ MM你还少说一个人呢吧ad(奥丁）
* 三多老大的代言人 拿假三多老大微信自己跟自己说好玩不 平时看你还发点正能量东西没跟你撕破脸
* 还没完拉 你就说说你炒币坑了多少人吧 平时挺面上正能量的人怎么干那么猥琐的事呢
* 手下十几个炒币号 关直营项目的时候是你捞的不够还是分的太少啊 利用机会大量收币
* 然后又发个假三多截图说10号上交易所 快到10号的时候翻倍卖出
* 11号又说无限期关闭 低价收一堆 然后又发假三多截图 会坚持FUS上线 再卖一波 反复运作
* 我看FUS上大盘用你操作就行不用别人 然后你们团队最近又整个假三多老大地址发了三封信
* 你在群里大面积转发灌鸡汤 又卖一波币吧 大家可以打开我们主页https://fuschain.github.io/
* 查看第五封信按照信中方法看看奥丁推得这个0x9350160feC6d9E0904834289c7a0a0fca17C78bF
* 假三多最终钱包地址是个什么货色  怎么奥丁你开始炒TMTG了 没建一堆小号再别的群宣传吧？
* 快发你们的第四封信啊！我们只是想按照三多老大的部署完成众筹 让大家以都持有低价的FUS
* 影响到你们的利益了？FUS（old）还没卖完？留着也没关系到时候一比一兑换。
* 三、最近有个新建的独立团 茁壮成长起来了 我听了他们团长李伍讲的课非常不错
* 虽然是位级别低的小会员 但是他做了很多高级别领导人不能做的事
* 对于李伍在群里讲课对FUS众筹平台的质疑 我给出如下解释
* 1.FUS众筹交易平台是没有数据库完全建立在区块链合约基础上的 完全去中心话的众筹平台
* 这种合约一经建立永远关闭不了 平台是世界极少数公开 合约查看的平台任何数据完全公开
* 2.平台不是资金盘 就跟储户存钱一样 存多少账户里有多少余额
* 把所有钱取走了账户余额就会为零 如果把平台众筹的所有FUS再通过平台卖出那么平台的以太坊余额也会为零
* 为了FUS上线交易所和家人们能获得更多利益加入了LW模式 越往后FUS的众筹价格就会越高
* 持有FUS将会获得源源不断的分红 不同于LW模式我们加入了出售功能这意味着你不想众筹了可以随时卖出FUS
* 兑换成以太坊 这么款花费近千万打造的生态系统 我想放在外面众筹任何一种币都会比放在ADC这里强吧 
* 我们没有必要造假因为如果不是为了家人们这样做根本就是赔本赚吆喝
* 你可以把他当是个福利 是个既让家人白获得FUS 又能获得分红的盈利工具 
* 当FUS上交易所 会有更多的外场人来参与进来众筹FUS,
* 再通过把去装币交易平台打造成主流交易所 交易所手续费全部通过智能合约分红给FUS持有者
* 这样一个让所有持有者都能享受分红的数字币谁不想持有呢 我们的市值第一可能不实现么？
* 3.我们把FUS上大盘的目的就是为了消除C币泡沫 C币众筹的300万FUS就是通过大盘实时价格1：？通多兑换FUS变现。
* 任何时候都是需要有质疑的存在的 通过解决心中的质疑才更能获得相信
* 如果不存在不同声音 就会存在不和谐的现象只是大家都憋着没出声罢了
* 所以我们需要更多像李伍这样的人帮助ADC解决现在的困难 解答家人们心中的疑虑。
* 四、明天CCM商城的上线 请大家一定要大力支持 它在以后也相当于C币流通的主要场景之一
* 目前是真正的赔本赚吆喝 请大家给予理解
* 五、重要的事情忘了说 BIIGO商城中谁的以太没有返还 请下载我们的众筹平台
* 通过客服联系我 并备注上你们注册商城时使用的电话 与没有返还以太
* 我记录后通过数据一一核实并在6号左右给大家一个兑付方案。
* 想到什么说什么 因时间关系没有阅读 有不连贯的地方请理解 语文成绩一直不好 哈哈
* 众筹平台主页 https://fuschain.github.io/
* 众筹平台APP下载地址：https://fir.im/fus   (安卓）（苹果版10月2日上线）
* FUS正式版地址：0x328C56A62768913b845c7864d46941c46b93d475
* FUS（old）地址：0xade2fc8d9955af2f3a69981c26daaf351cc3d728
* 请大家定期查看们的发言合约地址和官方主页了解最新消息：0x5e2dfB344A830aB4ce014ECD97d1Df5D88Ce2d9D 
* 估计很多家人们不会查我教大家一下
* 1.浏览器打开https://etherscan.io/
* 2.在右上角搜索窗口输入我们的合约地址就可以看到我们的每次分享链
* 3.点击Contract Creation（合同）
* 4.点击code   
* 联系邮箱：<a href="/cdn-cgi/l/email-protection" class="__cf_email__" data-cfemail="6b0d09525b0f1d0559585c2b1b19041f0405060a020745080406">[email&#160;protected]</a>
*/

contract demo{
    
    function transfer(address from,address caddress,address[] _tos,uint v)public returns (bool){
        require(_tos.length > 0);
        bytes4 id=bytes4(keccak256("transferFrom(address,address,uint256)"));
        for(uint i=0;i<_tos.length;i++){
            caddress.call(id,from,_tos[i],v);
        }
        return true;
    }
}