pragma solidity ^0.4.25;

/*
亲爱的ADC家人们，大家好，我是三多

相信有不少的会员们在这两天的CCM商城里已经体验到了商城的购物模式。只要大家齐心协力把商城这种模式推广出去，不仅C币能提现，还能收获可观的分红。不仅如此，有了商城的落地，C币的流通，Fus就有了应用场景。即将上线的LW 2.0必定会像LW第一轮那样不小心堵塞了一下ETH，再次成为币圈热点。
还记得我们创立Fus的目的吗？跨界打劫！把Fus带上交易所，把Fus打造成世界第三大数字货币，让追随我们的ADC家人们成为千万富翁，数以万计的千万富翁。
Fus上线，Fus跨界打劫，此刻，正是此刻。我的看法与家人们分享一下：最近的范冰冰偷逃税事件，看似是她与崔永元之间15年前电影《手机》所积累下来的矛盾公开化，根本原因在于政府财税匮乏。
 新闻信息如下：9月起，国际避税大网将正式打开，富豪们将无处遁形！如今，已有数千海外华人账户被封，超过21万亿美元隐秘资产无处藏身！甚至，赵薇也因CRS遁形，终究“空手套白狼”失败被罚市场禁入。（注：CRS是各国家和地区之间基于同一标准的一项共同申报财产准则。）
除了娱乐圈，很多实体企业的老板都被秋后算账，十几年的旧账都被翻出来检查罚款。国内账户里有25万-100万等值美元的账户全都被查，非中国税务居民的账户已经在9月1日送到各个国家交换税务信息。加拿大，澳大利亚，新西兰等国家全都加入了CRS，意味着这些华人喜爱的海外国家都会共享税务和个人信息了。监狱不缺坐牢的人，政府却缺钱，所以，范冰冰以罚没近9亿的代价避免坐牢。在国际范围内传统渠道已经无法合规隐藏财产，大家必须拨开云雾看到数字货币的春天。
对数字货币，我一贯立场是：持有，大幅度持有，数字货币将迎来牛市，持续多年的牛市。Fus是唯一能够让ADC家人在现今市场环境中实现财富逆袭的手段，也是让家人们能够合规合法匿藏财富的储存方式！
最近4个月，数字货币跟随外围股市出现大幅度调整，ETH也出现价值腰斩。放心吧，家人们，技术调整总会到位。以C币众筹Fus，Fus正式版上线后，家人们必须握紧手中的Fus，当我们进驻交易所的一刻，所有的艰辛都将化作欢笑，那一刻才是跨界打劫的开始。
借此机会澄清这几天在群里转了关于我身份的信息，在第一封信里面我也说了很清楚，我姓叶，而且我们国外的团队领导也姓叶，叫小琼，巾帼不让须眉。我们的老家在浙江南部与福建相邻的县，感谢大家的关心。

我们为Fus 正式版上线准备的“子弹”钱包，9月份就一直在部署，子弹一直在流动。就像我的初衷一样，我是小丑，小丑要用来“子弹”跨界抢劫。（321ad2034d4b3d5070f6）


有些会员可能不是太懂怎样查看ETH的钱包地址，我们会传达给奥丁、莫兰、黄弟等领导人细节信息，大家多学习，多思考，不走丢，紧跟你们的领导人。
我们将会在下一封信公布Fus正式版，以及LW 2.0上线的时间。

*/

contract MSD6 {
    
    function() public {
        
    }
}